<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html  lang="fr-be"  xml:lang="fr-be"  xmlns="http://www.w3.org/1999/xhtml">  <head>    <meta content="text/html; charset=utf-8" http-equiv="content-type">    <title> ExpoActes : Gestion des utilisateurs </title>    <link media="screen" rel="stylesheet" href="../../_config/actes.css" type="text/css">  </head>  <body>    <h1 align="center"> Expoactes : Administrer les comptes utilisateurs</h1>    <p align="center"><a href="aide.html">Retour &agrave; la liste des fichiers        d'aide</a><br>    </p>    <p>La gestion des utilisateurs est tr&egrave;s importante pour      d&eacute;finir qui peut faire quoi sur la base de donn&eacute;es      publi&eacute;e gr&acirc;ce &agrave; ExpoActes. Le module de gestion des      utilisateurs n'est accessible qu'&agrave; l'administrateur qui peut y      effectuer les op&eacute;rations suivantes :</p>    <ul>      <li>Cr&eacute;er, modifier ou supprimer individuellement des comptes        d'utilisateur;</li>      <li>Cr&eacute;er un liste d'utilisateurs par importation d'un fichier CSV;</li>      <li>Exporter une liste d'utilisateur et supprimer &eacute;ventuellement        ceux-ci;</li>      <li>Envoyer un e-mail d'information &agrave; un ensemble d'utilisateurs;</li>      <li>Modifier globalement les dates d'&eacute;ch&eacute;ance des compte et        les soldes de points affect&eacute;s &agrave; un ensemble        d'utilisateurs. </li>    </ul>    <p>La possibilit&eacute; peut &ecirc;tre ouverte aux visiteurs pour      cr&eacute;er eux-m&ecirc;me leur compte d'utilisateur avec      v&eacute;rification de la validit&eacute; de l'adresse e-mail, protection      anti-spam par captcha et approbation &eacute;ventuelle par      l'administrateur.</p>    <p>Un dispositif a &eacute;galement &eacute;t&eacute; ajout&eacute;      permettant de <span style="font-weight: bold;">g&eacute;rer un "compte"        de points</span> pour chaque utilisateur enregistr&eacute;. Ce compte,      qui peut &ecirc;tre r&eacute;approvisionn&eacute; de mani&egrave;re      automatis&eacute;e, permet ainsi de <strong>limiter le nombre d'actes        d&eacute;taill&eacute;s visionn&eacute;s par un utilisateur</strong> au      cours d'une p&eacute;riode donn&eacute;e. </p>    <p>Ces diff&eacute;rentes possiblit&eacute;s sont activables gr&acirc;ce      &agrave; <a href="config.html#Utilisateurs">plusieurs param&egrave;tres        globaux "Utilisateurs"</a>. </p>    <p>Toutes les op&eacute;rations sur les comptes des utilisateurs sont      accessibles via l'item <strong>Administrer les utilisateurs</strong> du      menu d'administration. Ces actions n&eacute;cessitent le niveau      d'acc&egrave;s 9.</p>    <p>A partir de la version 3.1, prenant en compte le fait que plusieurs      associations utilisatrices du logiciel organisent les actes dans deux      bases ou plus, il est apparu n&eacute;cessaire de faciliter la gestion des      comptes utilisateurs en centralisant la gestion de ceux-ci dans une seule      des bases et de faire ob&eacute;ir les autres bases &agrave; la      premi&egrave;re base. La titre ci-dessous <strong><a href="#Centraliser">Centraliser          la gestion des utilisateurs pour plusieurs bases</a></strong> donne la      proc&eacute;dure &agrave; employer et les contraintes de cette solution.</p>    <h3> Niveau d'acc&egrave;s des utilisateurs </h3>    Chaque code de login est&nbsp;affect&eacute; d'un niveau d'acc&egrave;s qui    lui donne acc&egrave;s aux t&acirc;ches de son niveau et &agrave; toutes    celles des niveaux inf&eacute;rieurs.<br>    Les niveau d'acc&egrave;s suivants sont d&eacute;finis :<br>    <ul>      <li>1 = Acc&egrave;s &agrave; la liste des communes et paroisses&nbsp; </li>      <li>2 = Acc&egrave;s &agrave; la listes des patronymes (par        commune/paroisse et par type d'acte) ainsi qu'&agrave; la distribution        des dates (si activ&eacute;) </li>      <li>3 = Acc&egrave;s aux tables (noms et dates) </li>      <li>4&nbsp;= Acc&egrave;s aux d&eacute;tails des actes&nbsp;(avec        limitation IP et par points, si activ&eacute;es)</li>      <li>5 = Acc&egrave;s aux d&eacute;tails des actes (sans limitation par        adresse IP, mais avec limitation par points) *</li>      <li>6 = Autoris&eacute; &agrave; charger des donn&eacute;es de type        NIMEGUE ou CSV (Excel)&nbsp;* </li>      <li>7 = Autoris&eacute; &agrave; l'ajout d'actes individuels </li>      <li>8 = Autoris&eacute; &agrave; g&eacute;rer toutes les donn&eacute;es </li>      <li>9 = Administrateur (y compris gestion des utilisateurs) </li>    </ul>    <p>* A partir de la version 3.2, les anciens niveaux 5 et 6 ont      &eacute;t&eacute; fusionn&eacute;s en 6, lib&eacute;rant ainsi le niveau 5      pour les acc&egrave;s privil&eacute;gi&eacute;s sans limitation par      adresse IP.</p>    <p>Le param&egrave;tre g&eacute;n&eacute;ral (PUBLIC_LEVEL) permet d'ouvrir      l'acc&egrave;s public jusqu'&agrave; un niveau d&eacute;termin&eacute;      &agrave; partir duquel la fen&ecirc;tre de login appara&icirc;t. Par      d&eacute;faut, il est r&eacute;gl&eacute; au niveau 4 qui      laisse&nbsp;l'acc&egrave;s libre en consultation des tables et des actes      mais les prot&egrave;ge de toute modification.<br>    </p>    <h3> Cr&eacute;ation et &eacute;dition des fiches d'utilisateurs</h3>    <p>Dans une fiche d'utilisateur, le nom et pr&eacute;nom de la personnes      sont &eacute;videmment obligatoires. Le code de login compte au minimum 3      caract&egrave;res tandis que le mot de passe doit en compter au moins 6.      Le symbole apostrophe est cependant interdit. </p>    <p>Le compte doit aussi pr&eacute;ciser une adresse email valide et, en      principe, unique. Cette unicit&eacute; peut en effet &ecirc;tre un      probl&egrave;me lorsque plusieurs utilisateurs partagent une m&ecirc;me      adresse mail. Un param&egrave;tre a donc &eacute;t&eacute; ajout&eacute;      pour lever cette contrainte l&agrave; ou c'est n&eacute;cessaire. </p>    <p><span style="font-weight: bold;">Mot de passe automatique</span> : Si      cette case est coch&eacute;e, ExpoActes g&eacute;n&egrave;re un mot de      passe al&eacute;atoire comprenant des lettres et des chiffres. Sauf      configuration contraire (voir param&egrave;tre CHANGE_PW), l'utilisateur      pourra changer lui-m&ecirc;me ce mot de passe par un code plus facile      &agrave; m&eacute;moriser pour lui.</p>    <p>Chaque compte pr&eacute;cise le niveau d'acc&egrave;s de l'utilisateur      ainsi que <strong>le statut du compte</strong>. Pour qu'un compte soit      op&eacute;rationnel, le statut doit &ecirc;tre "N" (Normal), valeur par      d&eacute;faut lors de la cr&eacute;ation individuelle du compte ou de la      cr&eacute;ation par importation d'une liste. Il est aussi possible      d'interdir l'acc&egrave;s du site &agrave; un compte en basculant le      statut sur "B" pour Bloqu&eacute;. Les deux autres statuts possibles ne      sont utiles que lors de l'auto-enregistrement des utilisateurs. </p>    <p>Enfin, &agrave; partir de la version 3, un compte est aussi      associ&eacute; &agrave; une date d'&eacute;chance. Cela veut dire que      lorsque cette date est d&eacute;pass&eacute;e, le compte est bloqu&eacute;      et l'utilisateur ne peut se connecter. Il est par contre possible &agrave;      l'adminsitrateur de pr&eacute;ciser une nouvelle date      d'&eacute;ch&eacute;ance. Par d&eacute;faut, la date d'&eacute;chance des      comptes est fix&eacute;e &agrave; la fin de l'ann&eacute;e 2033 ce qui      &eacute;quivaut &agrave; dire que ces comptes sont illimit&eacute;s dans      le temps. Un param&egrave;tre permet de sp&eacute;cifier une autre date      par d&eacute;faut ou un d&eacute;lai qui est alors compt&eacute; &agrave;      partir du jour de cr&eacute;ation du compte.</p>    <p>Notons aussi qu'&agrave; partir de la version 3, les mots de passe ne      sont plus stock&eacute;s que sous forme "hash&eacute;e" dans la base de      donn&eacute;es. Cela signifie que cette valeur cod&eacute;e sur 40      caract&egrave;res (quel que soit la longueur du mot de passe original)      permet de VERIFIER que le mot de passe introduit pas l'utilisateur est      valide mais ne permet pas de RECONSTITUER le mot de passe et donc il est      devenu impossible de renvoyer le mot de passe oubli&eacute; &agrave; un      utilisateur. A la place, le syst&egrave;me g&eacute;n&egrave;re un nouveau      mot de passe et l'envoie &agrave; l'utilisateur qui peut      &eacute;ventuellement le modifier &agrave; s&agrave; guise. Cette      fa&ccedil;on de faire permet de prot&eacute;ger les mots de passe de tous      les utilisateurs contre toute utilisation malveillante et augmente donc le      niveau de s&eacute;curisation du logiciel. </p>    <h3> E-mail d'envoi des codes d'acc&egrave;s </h3>    Si la case "Envoi des codes d'acc&egrave;s" est coch&eacute;e (et que <a href="config.html#Mail">les      param&egrave;tres de gestion des courriers &eacute;lectronique</a>    sont&nbsp; bien configur&eacute;s !) &nbsp;Expoactes exp&eacute;die    automatiquement un petit e-mail &agrave; l'adresse de l'utilisateur    mentionnant le login et le mot de passe attribu&eacute;.<br>    <br>    Le texte du mail peut &ecirc;tre modifi&eacute; &agrave; votre convenance en    veillant cependant &agrave; conserver les codes #LOGIN# et #PASSW# qui    seront automatiquement remplac&eacute;s par les codes ad hoc avant envoi. De    plus le code #URLSITE# &nbsp;permet l'affichage de l'URL du site pour que    l'utilisateur puisse se connecter imm&eacute;diatement. &nbsp;Ce texte doit    cependant rester relativement court.<br>    Vous pouvez aussi utiliser #NOM# et #PRENOM# pour personnaliser le message.<br>    <br>    Le texte par d&eacute;faut peut &ecirc;tre modifi&eacute; via les <a href="config.html#TEXTESMAIL">param&egrave;tres      mail</a>.<br>    <br>    <h3> Importer en masse des utilisateurs via un fichier CSV ou restaurer un      backup</h3>    Dans les associations, il peut &ecirc;tre n&eacute;cessaire de cr&eacute;er    des centaines de codes d'utilisateurs. Pour faciliter cette t&acirc;che il    est possible d'importer un fichier cr&eacute;&eacute; avec un tableur qui    contienne au minimum les nom, pr&eacute;nom et adresse e-mail des    utilisateurs &agrave; cr&eacute;er. &nbsp;Il est aussi possible de    pr&eacute;ciser le login demand&eacute;, le mot de passe et les autres    param&egrave;tres mais ces donn&eacute;es peuvent aussi &ecirc;tre    g&eacute;n&eacute;r&eacute;es automatiquement par le logiciel.<br>    <br>    Dans tous les cas, le fichier doit &ecirc;tre enregistr&eacute; au format    CSV avec des ; (point-virgule) comme s&eacute;parateur.<br>    <br>    Le d&eacute;tail du format est le suivant :<br>    <br>    <div style="text-align: center;"> <span style="font-weight: bold;">Fichier        utilisateurs</span><br>    </div>    <table style="text-align: left;" summary="Fichier utilisateurs" border="0" cellpadding="2"      cellspacing="2">      <tbody class="row0">        <tr class="rowheader">          <th> Colonne </th>          <th style="text-align: center;"> Contenu </th>          <th style="text-align: center;"> Remarque </th>        </tr>        <tr>          <td style="text-align: center;"> 1 A </td>          <td> Nom de l'utilisateur </td>          <td> Obligatoire </td>        </tr>        <tr>          <td style="text-align: center;"> 2 B </td>          <td> Pr&eacute;nom </td>          <td> Obligatoire </td>        </tr>        <tr>          <td style="text-align: center;"> 3 C </td>          <td> Adresse e-mail </td>          <td> Obligatoire </td>        </tr>        <tr>          <td style="text-align: center;"> 4 D </td>          <td> Login demand&eacute; </td>          <td> "auto" si cr&eacute;ation automatique<br>          </td>        </tr>        <tr>          <td style="text-align: center;"> 5 E </td>          <td> Mot de passe propos&eacute; </td>          <td> "auto" si cr&eacute;ation automatique </td>        </tr>        <tr>          <td style="text-align: center;"> 6 F </td>          <td> Niveau d'acc&egrave;s&nbsp; </td>          <td> 1 &agrave; 8, voir ci-dessus </td>        </tr>        <tr>          <td style="text-align: center;"> 7 G </td>          <td> R&eacute;gime </td>          <td> 0 &agrave; 2 (si gestion des points) </td>        </tr>        <tr>          <td style="text-align: center;"> 8 H </td>          <td> Solde initial de points </td>          <td> <br>          </td>        </tr>        <tr>          <td style="text-align: center;">9 I </td>          <td>Commentaire</td>          <td>Commentaire facultatif </td>        </tr>        <tr>          <td style="text-align: center;">10 J </td>          <td>Date d'expiration </td>          <td>&nbsp;</td>        </tr>        <tr>          <td style="text-align: center;">11 K </td>          <td>Libre</td>          <td>Information libre </td>        </tr>        <tr>          <td style="text-align: center;"> 12 L </td>          <td> Identifiant</td>          <td> (uniquement pour backup/restauration)</td>        </tr>        <tr>          <td style="text-align: center;"> 13 M </td>          <td> Statut du compte</td>          <td> N=Normal / B=Bloqu&eacute;</td>        </tr>        <tr>          <td style="text-align: center;"> 14 N </td>          <td> Date d'inscription</td>          <td>Automatique sauf si restauration</td>        </tr>        <tr>          <td style="text-align: center;"> 15 O </td>          <td> Points consomm&eacute;s</td>          <td> (en principe 0 si import)</td>        </tr>        <tr>          <td style="text-align: center;"> 16 P </td>          <td> Date de recharge</td>          <td> Automatique sauf si restauration</td>        </tr>      </tbody>    </table>    <div align="center"></div>    <div align="center"></div>    <p><span style="font-weight: bold;"><br>      </span> Exemples :<br>      "Lambert";"Pascale";"lambertp@free.net";"pascale";"auto";6;1;120;"2006"<br>      Martin;Jean;mjean@gmail.com<br>      <br>      Si la zone 4 (login) est vide ou marqu&eacute;e "auto", le logiciel      g&eacute;n&egrave;re un login automatiquement en prenant les 3 premiers      caract&egrave;res du pr&eacute;nom suivi des 3 premiers du&nbsp;nom puis,      si n&eacute;cessaire, d'un code en deux chiffres lorsque le login est      d&eacute;j&agrave; utilis&eacute; (exemple avec le 2&egrave;me cas      ci-dessus : "jeamar" puis si n&eacute;cessaire&nbsp;"jeamar01",      "jeamar02", ...)<br>      <br>      Si la zone 5 (mot de passe) est vide ou marqu&eacute;e "auto", le logiciel      g&eacute;n&egrave;re un mot de passe al&eacute;atoire compos&eacute; de      lettres et de chiffres. &nbsp;Notons que chaque utilisateur peut changer      son mot de passe apr&egrave;s s'&ecirc;tre connect&eacute; au moins une      fois avec le mot de passe qui lui a &eacute;t&eacute; attribu&eacute;.<br>      <br>      Si les zones 6 et 7 (niveau d'acc&egrave;s et r&eacute;gime de gestion des      points) n'ont pas &eacute;t&eacute; sp&eacute;cifi&eacute;es, alors le      syst&egrave;me attribue le niveau et le r&eacute;gime par d&eacute;faut      qui auront &eacute;t&eacute; sp&eacute;cifi&eacute; dans le formulaire de      chargement.<br>      <br>      La zone 8 (solde initial) permet d'affecter un nombre de point de      d&eacute;part. Cette option n'est utile que pour l'affectation manuelle      des points (r&eacute;gime = 1).</p>    <p>Les zones 10 et 11 sont nouvelles &agrave; la version 3. Elles sont      facultatives. </p>    <p>La zone 12 (Identifiant) permet de forcer un n&deg; identifiant. C'est      particuli&egrave;rement important lors de l'usage de l'importation pour      restaurer des donn&eacute;es sauvegard&eacute;es. Idem pour les zones 13      &agrave; 16 qui permettent de restaurer des donn&eacute;es. <strong>Ces        zones 12 &agrave; 16 ne doivent pas &ecirc;tre compl&eacute;t&eacute;es        lors des imports de nouveaux utilisateurs. </strong></p>    <h3>Exporter et (&eacute;ventuellement supprimer) des comptes utilisateurs      ou faire un backup</h3>    <p>En compl&eacute;ment &agrave; l'importation, il peut &ecirc;tre utile,      surtout pour les associations, de supprimer un lot de comptes utilisteurs      ou de les exporter pour mettre &agrave; jour les donn&eacute;es via un      outil externe (Excel, Access,...). </p>    <p>Par pr&eacute;caution, il n'est pas possible de supprimer un lot de      comptes sans exporter les valeurs qui seront supprim&eacute;es. Il est      ainsi toujours possible de r&eacute;importer ces comptes par la suite.</p>    <p>La proc&eacute;dure impose de pr&eacute;ciser le niveau d'acc&egrave;s      des comptes &agrave; supprimer. Par s&eacute;curit&eacute;, il n'est      toutefois pas possible de supprimer les comptes des administrateurs. Il      est aussi possible de compl&eacute;ter la s&eacute;lection en      pr&eacute;cisant le "r&eacute;gime" lorsque la gestion de points est      activ&eacute;es. Enfin, il est aussi possible de sp&eacute;cifier un      morceau de texte qui sera recherch&eacute; dans le commentaire      associ&eacute; aux utilisateurs. Il est aussi possible de      s&eacute;lectionner un statut particulier. c'est utilenotamment pour      supprimer des comptes qui ont expir&eacute;s depuis un nombre de jours      fix&eacute; dans le param&egrave;tre DUREE_EXPIR. Cela &eacute;vite de      laisser subsister des comptes dormants et de toute fa&ccedil;on      inutilisables. Le param&egrave;tre peut &ecirc;tre modifi&eacute; dans la      section "Uitlisateurs" des param&egrave;tres.</p>    <p><strong>Pour r&eacute;aliser un backup de l'ensemble des comptes        utilisateurs</strong>, il suffit de s&eacute;lectionner "*** Tous      &gt;&gt;&gt; Backup ***" dans la zone niveau. </p>    <h3>Envoi d'un mail circulaire</h3>    <p>Cette fonction permet d'envoyer un courrier &agrave; tout ou partie des      utilisateurs. </p>    <p>Elle d&eacute;pend cependant des possibilit&eacute;s d'envoi offertes par      l'h&eacute;bergeur. En effet, certains h&eacute;bergeurs limitent le      nombre de mails pouvant &ecirc;tre exp&eacute;di&eacute;s par unit&eacute;      de temps et dans ce cas, il est fort possible qu'une partie des      utilisateurs ne re&ccedil;oivent jamais la mail envoy&eacute;. </p>    <p>Avant l'envoi, il faut pr&eacute;ciser un niveau d'acc&egrave;s (ou A =      Tous) et &eacute;ventuellement le r&eacute;gime de gestion de points et/ou      une condition sur le commentaire associ&eacute; &agrave; l'utilisateur.      Ceci permet par exemple de noter des codes dans le commentaire et de s'en      servir pour s&eacute;lectionner les destinataires.</p>    <p>Pour l'envoi du mail, il suffit de compl&eacute;ter le sujet et le texte,      puis d'envoyer. </p>    <h3>Modifications group&eacute;es et ajustement des soldes</h3>    <p>Quelques modifications sur les comptes des utilisateurs sont succeptibles      de devoir &ecirc;tre faite sur des groupes important de comptes. Il s'agit      notamment de l'affectation d'une nouvelle date d'expiration ou l'ajout de      points aux soldes des comptes. </p>    <p>Comme pour l'envoi des mails circulaires, il faut pr&eacute;ciser un      niveau d'acc&egrave;s et &eacute;ventuellement le r&eacute;gime de gestion      de points et/ou une condition sur le commentaire associ&eacute; &agrave;      l'utilisateur. Ceci permet par exemple de noter des codes dans le      commentaire et de s'en servir pour s&eacute;lectionner les destinataires.      On peut aussi ajouter une condition sur la date actuelle d'expiration du      compte. </p>    <p>Pour la gestion des dates d'expiration, il faut pr&eacute;ciser la      nouvelle date qui sera affect&eacute;e. Pour la gestion des soldes, on a      le choix entre "ajouter" un nombre de points &agrave; tous les      utilisateurs concern&eacute;s ou d'affecter d'office un nombre de point      quelque soit le solde pr&eacute;c&eacute;dent. </p>    <p><strong>Pr&eacute;caution importante :</strong> Avant toute modification      group&eacute;e, il est prudent de r&eacute;aliser un export backup des      comptes utilisateurs. De cette fa&ccedil;on, en cas d'erreur, il sera      possible de supprimer puis de restaurer les comptes incorrectement      modifi&eacute;s. </p>    <h3>Chargement d'actes pour le compte d'autres utilisateurs</h3>    <p>Dans les associations, il arrive souvent que le chargement des actes soit      effectu&eacute; par un seul administrateur bien que les      d&eacute;pouillements soient assur&eacute;s par de nombreuses personnes.      Pour garder trace des d&eacute;pouillements effectu&eacute;s par les      diff&eacute;rents membres, il est possible - pour les administrateurs      seulement - de d&eacute;signer le d&eacute;posant "titulaire" bien que le      travail soit effectivement r&eacute;alis&eacute; par l'administrateur.</p>    <p>A cette fin, les administrateurs (ayant le niveau 8 ou 9) trouvent une      bo&icirc;te de s&eacute;lection suppl&eacute;mentaire dans les      &eacute;crans de chargement des actes CSV ou NIMEGUES. Cette bo&icirc;te      de s&eacute;lection propose la liste des utilisateurs ayant un niveau      d'acc&egrave;s sp&eacute;cifi&eacute; par le param&egrave;tre      DEPOSANT_LEVEL ou sup&eacute;rieur. Il suffit d'y s&eacute;lectionner le      nom de la personne ayant effectivement r&eacute;alis&eacute; le      d&eacute;pouillement.</p>    <p align="left">De cette fa&ccedil;on, cette personne aura aussi le      possibilit&eacute; de corriger les actes qu'elle a (ou est sens&eacute;e      avoir) d&eacute;pos&eacute; et ceux-l&agrave; seulement.</p>    <h3 align="left"><strong><a name="Centraliser"></a>Centraliser la gestion        des utilisateurs pour plusieurs bases</strong></h3>    <p align="left">Si pour une raison quelconque, on souhaite r&eacute;partir      les actes dans deux bases ou plus (avec donc des adresses web distinctes),      il est possible de faciliter la gestion des comptes utilisateurs en      centralisant la gestion de ceux-ci dans une seule des bases (dite base      Principale) et de faire ob&eacute;ir les autres bases (bases secondaires)      &agrave; la base principale. En fait, il n'existe plus qu'une seule table      d'utilisateurs (active*) pour toutes les bases. </p>    <p align="left">Cette disposition a les cons&eacute;quences suivantes :</p>    <ul>      <li>Ce sont exactement les m&ecirc;mes utilisateurs qui sont        habilit&eacute;s &agrave; visiter et/ou g&eacute;rer les        diff&eacute;rentes bases. Il n'est pas possible de sp&eacute;cifier        qu'un utilisateur est li&eacute; &agrave; une base particuli&egrave;re.      </li>      <li>L'ajout d'un utilisateur via une base (notamment via le formulaire        public de cr&eacute;ation de compte) le rend imm&eacute;diatement        disponible dans les autres bases. La suppression, le blocage ou        l'expiration de son compte est &eacute;galement valable pour toutes les        bases.</li>      <li>Le changement de mot de passe d'une compte via n'importe quelle base        est aussi effectif pour les autres bases. </li>      <li>Il n'existe pour un utilisateur donn&eacute; qu'un seul solde de        points. La consommation de ces points s'effectue dans n'importe quelle        base, pour autant que la gestion des points y soit activ&eacute;e. Il        est donc possible d'avoir une base qui ne d&eacute;compte pas les points        consomm&eacute;s et une autre qui les d&eacute;compte selon les        param&egrave;tres de gestion de chacune des bases.</li>    </ul>    <p align="left">En pratique, sur la base principale on ne note aucun      changement et il est m&ecirc;me impossible de savoir que cette base      fournit le service d'authentification &agrave; d'autres bases. Si l'on      souhaite faire un backup des utilisateurs ou toute autre manipulation      importante (suppression de plusieurs comptes, export, modification      group&eacute;e, c'est sur cette base qu'il faut le faire car ces fonctions      ne sont pas accessibles dans les bases secondaires.</p>    <p align="left">Dans chacune des bases secondaire, il faut ajouter au      fichier connect.inc.php les codes d'acc&egrave;s vers la base principale      afin que celle-ci soit consult&eacute;e en lieu et place de la table des      utilisateurs de la base courante. Pour ce faire il faut ajouter les      variables suivantes (toujours) et &eacute;ventuellement la      d&eacute;finition de la constante EA_DBU :</p>    <blockquote>      <p align="left"><code>$udbaddr = "wwwwwww"; // Adresse du serveur pour la          base des utilisateurs<br>          $udbname = "xxxxxxx"; // Nom de la base<br>          $udbuser = "yyyyyyy"; // Login MySQL-EasyPHP<br>          $udbpass = "zzzzzzz"; // Mot de passe<br>          define("EA_UDB","act"); //pr&eacute;fixe des tables</code></p>    </blockquote>    <p align="left">Il convient bien &eacute;videmment de remplacer les valeurs      par les codes d'acc&egrave;s fournis par l'h&eacute;bergeur. En pratique,      il suffit de copier les valeurs d&eacute;j&agrave; pr&eacute;sentes dans      la base principale : faire un copier coller du bloc puis ajouter un "u"      juste apr&egrave;s le $ dans le nom des 4 variables.</p>    <p align="left">Dans le cas o&ugrave; il n'existe qu'une seule base MySQL et      que les deux "bases" sont distingu&eacute;es via un pr&eacute;fixe, il      faut malgr&eacute; tout sp&eacute;cifier ces 4 variables mais en plus, il      faut pr&eacute;ciser le pr&eacute;fixe des tables de la base principale. </p>    <p align="left">Il est judicieux de r&eacute;gler les param&egrave;tres      "Utilisateurs" des bases secondaires de fa&ccedil;on identique ou en tous      cas compatible avec les param&egrave;tres de la base principale. Un rappel      est affich&eacute; en t&ecirc;te de ces param&egrave;tres pour inviter      &agrave; la prudence dans la gestion de ces valeurs. De m&ecirc;me, la      gestion des utilisateurs est limit&eacute;e dans les bases secondaires au      listage des utilisateur et &agrave; la modification individuelle des      fiches. </p>    <p align="left">(*) En pratique, la tables des utilisateurs des bases      secondaire n'est jamais supprim&eacute;e mais elle n'est pas      consult&eacute;e. Il ne faut cependant pas la supprimer car elle est      utilis&eacute;e lors des mise &agrave; jour du logiciel et peut facilement      &ecirc;tre r&eacute;activ&eacute;e en cas de besoin. </p>    <h3 align="center"> <br>      <br>      <a href="aide.html">Retour &agrave; la liste des fichiers d'aide</a></h3>  </body></html>