<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html
  lang="fr-be"
  xml:lang="fr-be"
  xmlns="http://www.w3.org/1999/xhtml">
<head>

  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=windows-1252">
  <title>Aide : Inventaire des actes</title>
  <link media="screen" rel="stylesheet" href="../../_config/actes.css" type="text/css">
</head>


<body>

<h1 align="center">Modifier
ou supprimer des actes</h1>
<p align="center"><a href="aide.html">Retour &agrave; la liste des fichiers d'aide</a></p>
Chaque acte est associ&eacute; avec le code de la personne qui a
charg&eacute; cet acte dans la base de donn&eacute;es (le
d&eacute;posant). La navigation dans les actes en mode
administration permet d'afficher le nom du d&eacute;posant de
l'acte. De plus, lorsque ce sont des actes que vous avez
d&eacute;pos&eacute;, le syst&egrave;me ajoute des
ic&ocirc;nes permettant de modifier ou de supprimer l'acte :<br>
<ul>
  <li>Dans le cas des actes de mariage ou des promesses de
mariage, &nbsp;l'ic&ocirc;ne <img style="width: 11px; height: 13px;" alt="Permuter" src="../../img/permuter.gif"> &nbsp;permet
d'&eacute;changer les donn&eacute;es de l'&eacute;poux avec
celles de l'&eacute;pouse. Cette option est surtout utile lorsque
les actes ont &eacute;t&eacute; charg&eacute;s via un
fichier CSV qui ne distingue pas clairement &eacute;poux et
&eacute;pouse;</li>
  <li>L'ic&ocirc;ne <img style="width: 12px; height: 13px;" alt="Modifier" src="../../img/modifier.gif"> permet de corriger les
donn&eacute;es d'un acte;</li>
  <li>L'ic&ocirc;ne <img style="width: 11px; height: 13px;" alt="Supprimer" src="../../img/supprimer.gif"> permet de supprimer
d&eacute;finitivement un acte (le syst&egrave;me demande
confirmation mais ensuite, il n'existe pas de moyen de retrouver
l'acte).</li>
</ul>
<p>L'acc&egrave;s &agrave; ces fonctions d'&eacute;dition et de
  suppression d'acte est &eacute;galement disponible via un menu en bas
  de l'acte lorsqu'il est visualis&eacute; en mode "administration".<br>
  
<br>
  L'&eacute;dition d'un acte permet de modifier toutes les zones descriptives de cet acte. &nbsp;<span style="font-weight: bold;">Il
  faut toutefois noter que ExpoActes, contrairement &agrave; NIMEGUE, ne
  comprend pratiquement AUCUN m&eacute;canisme de validation des
  donn&eacute;es introduites.</span> En effet, l'int&eacute;r&ecirc;t est
  essentiellement de pouvoir r&eacute;aliser une correction ponctuelle
  d'une date ou d'une information et en aucun cas de fournir une
  interface de saisie d'actes. &nbsp;Pour ce travail il est beaucoup plus
  pratique d'utiliser le <a href="http://www.cegfc.net/nimegue/">logiciel NIMEGUE</a> qui est con&ccedil;u pour cela. Au besoin, le menu "R&eacute;exporation
  d'actes" permet de g&eacute;n&eacute;rer un fichier qui peut &ecirc;tre
facilement import&eacute; par NIMEGUE.</p>
<p>La version 3 permet aussi d'ajouter ponctuellement un acte qui aurait &eacute;t&eacute; oubli&eacute; mais cette fonction n'est accessible qu'aux utilisateurs ayant le niveau d'acc&egrave;s 8 (Administrer tous les actes) ou 9. <br>
  <br>
     
  <a href="aide.html">Sommaire de l'aide</a>
</p>
</body>
</html>
